### Тема np

#### Задание 1

In [ ]:
import numpy as np

In [ ]:
a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1, 7]])
a

Вычисление среднего значения по каждому признаку

In [ ]:
mean_a = a.mean(axis=0)
mean_a

#### Задание 2

In [ ]:
a_centered = a - mean_a
a_centered

#### Задание 3

Создаем вектор a1 со значениями из первого столбца и a2 со значеними из второго столбца

In [ ]:
a1 = np.array(a_centered[:, 0])
a2 = np.array(a_centered[:, 1])

Вычисляем скалярное произведение двух получившихся векторов

In [ ]:
a_centered_sp = np.dot(a1, a2)
a_centered_sp

In [ ]:
b = a_centered_sp / 4
print(f'Результат вычисления равен: {b}')

### Тема работа с pd

In [1]:
import pandas as pd

#### Задание 1

In [2]:
authors = pd.DataFrame({'author_id' : [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
book = pd.DataFrame({'author_id' : [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price' : [450, 300, 350, 500, 450, 370, 290]})

In [5]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2

In [6]:
authors_price = pd.merge(authors, book, on = 'author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3

Сортировка записей по убыванию цены

In [7]:
authors_price = authors_price.sort_values(by = 'price', ascending=False)
authors_price

   author_id author_name            book_title  price
3          2       Чехов      Толстый и тонкий    500
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
2          1    Тургенев     Дворянское гнездо    350
1          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

Создаем датафрейм с 5 самыми дорогими книгами

In [8]:
top5 = authors_price.head(5)
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

#### Задание 4

In [9]:
authors_stat1 = authors_price.groupby('author_name').agg({'price' : min}) 
authors_stat1.rename(columns = {'price' : 'min_price'}, inplace=True)
authors_stat1

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [10]:
authors_stat1['max_price'] = authors_price.groupby('author_name').agg({'price' : max})
authors_stat1

             min_price  max_price
author_name
Островский         290        370
Тургенев           300        450
Чехов              450        500

In [11]:
tmp = authors_price.groupby('author_name').mean()
tmp.rename(columns = {'price' : 'mean_price'}, inplace=True)
tmp.drop("author_id", axis=1, inplace=True)
tmp

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [12]:
authors_stat = pd.merge(authors_stat1, tmp, on = 'author_name')
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000